Public Attributes | List of all members
API_AMPartRefRatioEdgeData Struct Reference
Analytical Model
Describes the ratios when the analytical member part has ratio edge type. More...
#include <APIdefs_AnalyticalElements.h>
 Public Attributes
 double  | ratioStart
This value represents the location of the start node on the edge (percentage)
 double  | ratioEnd
This value represents the location of the end node on the edge (percentage)
Detailed Description
Describes the ratios when the analytical member part has ratio edge type.
Since
Archicad 25